nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mk0512mcf100.h
typedef enum {

    ADCHS_TRIGGER_SOURCE_NONE = 0,
    ADCHS_TRIGGER_SOURCE_GLOBAL_SOFTWARE_EDGE = 1,
    ADCHS_TRIGGER_SOURCE_SOFTWARE_LEVEL = 2,
    ADCHS_TRIGGER_SOURCE_INT0 = 4,
    ADCHS_TRIGGER_SOURCE_TMR1_MATCH = 5,
    ADCHS_TRIGGER_SOURCE_TMR3_MATCH = 6,
    ADCHS_TRIGGER_SOURCE_TMR5_MATCH = 7,
	ADCHS_TRIGGER_SOURCE_PWM_PRIMARY_TIMEBASE = 8,
	ADCHS_TRIGGER_SOURCE_PWM_SECONDARY_TIMEBASE = 9,
	ADCHS_TRIGGER_SOURCE_PWM1 = 10,
	ADCHS_TRIGGER_SOURCE_PWM2 = 11,
	ADCHS_TRIGGER_SOURCE_PWM3 = 12,
	ADCHS_TRIGGER_SOURCE_PWM4 = 13,
	ADCHS_TRIGGER_SOURCE_PWM5 = 14,
	ADCHS_TRIGGER_SOURCE_PWM6 = 15,
    ADCHS_TRIGGER_SOURCE_OC1 = 16,
    ADCHS_TRIGGER_SOURCE_OC2 = 17,
    ADCHS_TRIGGER_SOURCE_OC3 = 18,
    ADCHS_TRIGGER_SOURCE_OC4 = 19,
    ADCHS_TRIGGER_SOURCE_CTMU = 20,
	ADCHS_TRIGGER_SOURCE_PWM1_CURRENT_LIMIT = 24,
	ADCHS_TRIGGER_SOURCE_PWM2_CURRENT_LIMIT = 25,
	ADCHS_TRIGGER_SOURCE_PWM3_CURRENT_LIMIT = 26,
	ADCHS_TRIGGER_SOURCE_PWM4_CURRENT_LIMIT = 27,
	ADCHS_TRIGGER_SOURCE_PWM5_CURRENT_LIMIT = 28,
	ADCHS_TRIGGER_SOURCE_PWM6_CURRENT_LIMIT = 29

} ADCHS_TRIGGER_SOURCE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/adchs_Registers_pic32mk.h"
#include "../templates/adchs_EnableControl_Default.h"
#include "../templates/adchs_TurboMode_Default.h"
#include "../templates/adchs_DigitalComparator_pic32mk.h"
#include "../templates/adchs_DigitalFilter_pic32mk.h"
#include "../templates/adchs_FIFO_Unsupported.h"
#include "../templates/adchs_DMA_Default.h"
#include "../templates/adchs_CVD_Default.h"
#include "../templates/adchs_VREFControl_Default.h"
#include "../templates/adchs_AnalogInputScan_Default.h"
#include "../templates/adchs_AnalogFeatureControl_Default.h"
#include "../templates/adchs_DigitalFeatureControl_pic32mk.h"
#include "../templates/adchs_AnalogInputModeControl_Default.h"
#include "../templates/adchs_TriggerControl_Default.h"
#include "../templates/adchs_ChannelTriggerSampleControl_Default.h"
#include "../templates/adchs_EarlyInterruptControl_Default.h"
#include "../templates/adchs_ManualControl_Default.h"
#include "../templates/adchs_UpdateReadyControl_Default.h"
#include "../templates/adchs_InputControl_Default.h"
#include "../templates/adchs_ExternalConversionRequest_Unsupported.h"
#include "../templates/adchs_Setup_pic32mk.h"
#include "../templates/adchs_AnalogInputCheck_Default.h"
#include "../templates/adchs_ChannelConfiguration_Default.h"
#include "../templates/adchs_ConversionResult_Default.h"
#include "../templates/adchs_ScanEnable_Unsupported.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API bool PLIB_ADCHS_ExistsRegisters(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsRegisters_pic32mk(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Enable(ADCHS_MODULE_ID index)
{
     ADCHS_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Disable(ADCHS_MODULE_ID index)
{
     ADCHS_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsEnableControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsEnableControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TurboModeEnable(ADCHS_MODULE_ID index)
{
     ADCHS_TurboModeEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TurboModeDisable(ADCHS_MODULE_ID index)
{
     ADCHS_TurboModeDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_TurboModeErrorHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_TurboModeErrorHasOccurred_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_TurboModeChannelSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID masterChannelID, ADCHS_CHANNEL_ID slaveChannelID)
{
     return ADCHS_TurboModeChannelSelect_Default(index, masterChannelID, slaveChannelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsTurboMode(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsTurboMode_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorAnalogInputSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_DigitalComparatorAnalogInputSelect_pic32mk(index, digComparator, analogInput);
}

PLIB_INLINE_API ADCHS_AN_INPUT_ID PLIB_ADCHS_DigitalComparatorAnalogInputGet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     return ADCHS_DigitalComparatorAnalogInputGet_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorEnable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorDisable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorInterruptEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorInterruptEnable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorInterruptDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorInterruptDisable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id, bool intEnable, bool inBetweenOrEqual, bool greaterEqualHi, bool lessThanHi, bool greaterEqualLo, bool lessThanLo, ADCHS_AN_INPUT_ID analogInput, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_DigitalComparatorSetup_pic32mk(index, id, intEnable, inBetweenOrEqual, greaterEqualHi, lessThanHi, greaterEqualLo, lessThanLo, analogInput, hiLimit, loLimit);
}

PLIB_INLINE_API bool PLIB_ADCHS_DigitalComparatorEventHasOccurred(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id)
{
     return ADCHS_DigitalComparatorEventHasOccurred_pic32mk(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorLimitSet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_DigitalComparatorLimitSet_pic32mk(index, id, hiLimit, loLimit);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDigitalComparator(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDigitalComparator_pic32mk(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     ADCHS_DigitalFilterEnable_pic32mk(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     ADCHS_DigitalFilterDisable_pic32mk(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterOversamplingModeSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_AN_INPUT_ID analogInput, ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS length, ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO ratio, bool intEnable)
{
     ADCHS_DigitalFilterOversamplingModeSetup_pic32mk(index, id, analogInput, length, ratio, intEnable);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterAveragingModeSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_AN_INPUT_ID analogInput, ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS length, ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT count, bool intEnable)
{
     ADCHS_DigitalFilterAveragingModeSetup_pic32mk(index, id, analogInput, length, count, intEnable);
}

