nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mk0512mcf100.h
PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEarlyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEarlyInterruptEnable_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEarlyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEarlyInterruptDisable_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputEarlyInterruptIsReady(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputEarlyInterruptIsReady_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsEarlyInterruptControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsEarlyInterruptControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareSamplingStart(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareSamplingStart_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareSamplingStop(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareSamplingStop_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareConversionStart(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareConversionStart_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareConversionInputSelect(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID anInput)
{
     ADCHS_SoftwareConversionInputSelect_Default(index, anInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsManualControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsManualControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ControlRegistersCanBeUpdatedInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ControlRegistersCanBeUpdatedInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ControlRegistersCanBeUpdatedInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_ControlRegistersCanBeUpdatedInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ControlRegistersCanBeUpdated(ADCHS_MODULE_ID index)
{
     return ADCHS_ControlRegistersCanBeUpdated_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsUpdateReadyControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsUpdateReadyControl_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ChannelInputSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, ADCHS_CHANNEL_INP_SEL sel)
{
     return ADCHS_ChannelInputSelect_Default(index, channelID, sel);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelInputSelectControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelInputSelectControl_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ExternalConversionRequestEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ExternalConversionRequestEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ExternalConversionRequestDisable(ADCHS_MODULE_ID index)
{
     ADCHS_ExternalConversionRequestDisable_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsExternalConversionRequestControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsExternalConversionRequestControl_Unsupported(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Setup(ADCHS_MODULE_ID index, ADCHS_VREF_SOURCE voltageRefSelect, ADCHS_CHARGEPUMP_MODE chargePump, ADCHS_OUTPUT_DATA_FORMAT outputFormat, bool stopInIdle, ADCHS_FAST_SYNC_SYSTEM_CLOCK sysClk, ADCHS_FAST_SYNC_PERIPHERAL_CLOCK periClk, ADCHS_INTERRUPT_BIT_SHIFT_LEFT intVectorShift, uint16_t intVectorBase, ADCHS_CLOCK_SOURCE adcClockSource, int8_t adcClockDivider, ADCHS_WARMUP_CLOCK warmUpClock)
{
     ADCHS_Setup_pic32mk(index, voltageRefSelect, chargePump, outputFormat, stopInIdle, sysClk, periClk, intVectorShift, intVectorBase, adcClockSource, adcClockDivider, warmUpClock);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelSetup(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, ADCHS_DATA_RESOLUTION res, uint8_t channelClockDivider, uint16_t sampleTimeCount, ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK earlyInterruptClk)
{
     ADCHS_ChannelSetup_pic32mk(index, channelID, res, channelClockDivider, sampleTimeCount, earlyInterruptClk);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsConfiguration(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsConfiguration_pic32mk(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputIsAvailable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputIsAvailable_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsAnalogInputCheck(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsAnalogInputCheck_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_ADCHS_ChannelConfigurationGet(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_ChannelConfigurationGet_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelConfigurationSet(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, uint32_t config)
{
     ADCHS_ChannelConfigurationSet_Default(index, channelID, config);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelConfiguration(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelConfiguration_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputDataReadyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputDataReadyInterruptEnable_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputDataReadyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputDataReadyInterruptDisable_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputDataIsReady(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputDataIsReady_Default(index, analogInput);
}

PLIB_INLINE_API uint32_t PLIB_ADCHS_AnalogInputResultGet(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputResultGet_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsConversionResults(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsConversionResults_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ChannelScanEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ChannelScanEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ChannelScanAbort(ADCHS_MODULE_ID index)
{
     ADCHS_ChannelScanAbort_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsScanEnable(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsScanEnable_Unsupported(index);
}

#endif
